/*
 *@description:
 * @author wayne
 * @date 2023-05-09 10:32
 */
import "./index.scss";
import { Text } from "@tarojs/components";

export const List = [
	{
		title: "一、接受条款"
	},
	{
		text: (
			<>
				<Text className={"fontWeightBold textDecoration"}>津志惠小程序</Text>
				（以下简称“小程序”）由天津泰达低碳经济促进中心有限公司（以下简称“我们”或“低碳中心”）做技术支撑和运营。您要访问和使用该小程序则需要接受《津志惠平台用户服务协议》
				(以下简称“用户协议”)。根据本用户协议的条款及发布的规则为您（用户）提供基于津志惠的互联网以及移动网的相关服务。本用户协议规定了您访问和使用小程序及我们通过小程序提供的任何服务
				(以下统称“服务”)的相关条款。请仔细阅读这些条款，如果您对用户协议有任何异议，请勿使用小程序及任何服务。
			</>
		)
	},
	{
		text: "我们保留随时在小程序上发布对用户协议进行变更的权利，如果我们对本用户协议进行了任何重大修订，我们将在本页发布变更后的用户协议及其生效日期。如果您拒绝接受用户协议的任何变更，请务必停止使用小程序。在用户协议中，“用户”和“您”指小程序的每位访客。小程序以中文为主要语言。"
	},
	{
		lastText: (
			<>
				如果您订购或使用碳币兑换/抵扣小程序提供的任何服务或商品，或参与相关公益活动，可能还需要遵守此类服务适用的其他条款和条件
				(以下简称“服务条款”)，我们将在您使用时告知您该等条款和条件。您在申请注册流程中同意本用户协议之前，应当认真阅读本用户协议。用户接受本用户协议选择:“点击登录即视为您同意《津志惠平台用户服务协议》”，完成注册即表示用户与我们达成协议并接受所有服务条款。阅读本用户协议过程中，如果您不同意本用户协议或其中任何条款约定，您应立即停止注册程序。
			</>
		)
	},
	{
		title: "二、津志惠小程序服务"
	},
	{
		text: "您须在小程序上注册才能获取和使用服务，或参与相关活动。此外，我们保留在未事先通知的情况下限制用户获取或使用某些服务(或服务的任何功能)，或设置其他低碳中心自行决定的限制条件的权利。"
	},
	{
		text: "我们不能保证访问或使用小程序或服务时不会出现中断或错误，对于非由于我们的过错或者重大过失导致的小程序和服务的任何功能无法访问或无法使用的情形，低碳中心不承担任何责任。为满足用户需要或因技术或其他原因，低碳中心可在不事先通知或说明原因的情况下随时扩展、限制或修改小程序及其功能。我们也可在不事先通知的情况下随时自行决定临时性或永久性停止提供任何或所有小程序服务。服务(或服务的功能)可能因国家/地区而异。我们不保证或声明所有用户都能取得某项服务或服务的某项功能特性，或取得的服务或其功能特性的类型和范围相同。我们可自行决定限制或拒绝不同用户获取和使用的服务(或服务功能)，或为不同用户创设不同的服务 (或服务功能)获取和使用级别。"
	},
	{
		lastText:
			"为获取小程序或其服务的某些内容或功能，用户可能需要升级或更新其计算机系统中的硬件或软件。若因用户系统、互联网或其他原因造成小程序或服务部分或全部无法访问，低碳中心不承担任何责任。"
	},
	{
		title: "三、津志惠小程序简介"
	},
	{
		lastText: "津志惠平台旨在积极倡导绿色低碳生活方式，着力打造人人参与的碳普惠体系，助力可持续发展。"
	},
	{
		title: "四、津志惠提供的服务内容说明"
	},
	{
		subTitle: "1、碳币内容"
	},
	{
		text: "1）每日打卡：通过每日步行、一餐素食、光盘行动等系统设定的多种打卡事项，可获得碳币奖励。"
	},
	{
		text: "2）其他活动：系统会不定期组织公益活动，完成相应公益活动，可获得碳币奖励。"
	},
	{
		text: "3）违规处罚：若出现不正当手段 (包括但不限于批量注册、用户机器注册账户、作弊、扰乱系统等)获取的碳币，经核实后，我们有权取消用户已获得碳币，并对账号进行封禁，同时追究法律责任。"
	},
	{
		text: "4）有效期限：已获取碳币有效期为永久有效。"
	},
	{
		subTitle: "2、碳币兑换"
	},
	{
		lastText:
			"用户可在小程序的碳币兑换专区进行不定期礼品兑换（礼品不限于实物、同游优惠券、指定商品优惠券等，具体以小程序活动为主）。"
	},
	{
		subTitle: "3、基线测算"
	},
	{
		lastText:
			"用户需要在使用小程序时填写每周碳排放数据，会有一些关于您饮食和通勤方面的问题（个人碳排放计算数据参考来源：丹麦KlimaDatabase气候数据库，《北京市低碳出行气候方法学》。如政府有关部门发布新算法，则使用新算法。算法最终解释权为低碳中心所有，如有疑问请及时与我们客服联系）。"
	},
	{
		subTitle: "4、商城"
	},
	{
		lastText:
			"请您知悉，津志惠小程序商城产品由第三方同步开发，津志惠小程序仅作为展示平台，并不对商城产品作出任何承诺与担保。如果您对商城产品感兴趣并进行点击，点击后将自动跳转第三方平台，津志惠小程序不进行购买等操作。"
	},
	{
		title: "五、小程序内容和服务限制"
	},
	{
		text: "请您知悉，小程序或者服务中的信息可能由第三方提供，我们不保证小程序或服务中提供的该等信息的准确性、完整性或优质性，我们仅按“原样”提供“可用”信息，您应当自行对相关信息的真实性、可用性进行判断并自行承担可能产生的风险。小程序上提供的信息和投资、会计或法律分析策略(如有)既不全面也并非对每个人都适用。有些信息仅与中国大陆和香港相关，可能不符合其他国家的法律、法规或其他法律要求或与之无关。如果您想要使用这些信息，则您有责任确定此种使用是否在技术上和法律上在意图使用的地区可行，其可行性方案及范围。我们建议您在将任何信息用于个人、财务、会计、法律或商业用途前，先对该信息进行核实。另外，小程序发布的及服务过程中发布的意见和观点不代表低碳中心或其管理层的意见或建议。我们可能在不事先通知或说明原因的情况下随时修改小程序的内容和服务，且低碳中心没有义务通知您小程序内容和服务的更正或变更。"
	},
	{
		lastText:
			"我们不保证小程序或服务中的相关产品、商品的品质、功用或效果。对于小程序中的相关公益活动，我们无法核实和确保相关公益活动的具体执行情况以及公益活动的实现效果。"
	},
	{
		title: "六、使用小程序内容和服务的许可"
	},
	{
		text: "我们仅许可您本人在限定范围内访问和使用本小程序的内容和服务，前提是不得修改该内容并应完整保留全部所有权声明。您不得复制、发布、翻译、合并、出售、出租、分发内容或在其他网站或小程序上制作其衍生品，也不得将之作为任何教育、培训或参考资料。您不得对小程序和服务中获取的任何内容进行封装成帧或利用封装成帧技术进行处理。"
	},
	{
		lastText:
			"如您是未成年用户，请在父母或法定监护人的陪同下仔细阅读本使用协议，您及父母或法定监护人应按照法律及本协议规定承担责任。"
	},
	{
		title: "七、第三方服务"
	},
	{
		lastText:
			"第三方在服务中提供的任何推荐、意见、建议、产品或服务报价 (以下简称“第三方内容”) (如有) 仅为其各自供应商的报价，而非低碳中心的报价，低碳中心不保证该第三方内容的准确性、完整性、可靠性或有用性。用户有责任对第三方内容进行评估，因用户信赖或以其他方式使用第三方内容造成的任何损害或损失，低碳中心不承担任何责任。"
	},
	{
		title: "八、病毒"
	},
	{
		text: "您理解并同意，在符合法律规定的情况下，低碳中心对以下事由所导致的服务中断或终止或数据丢失、消除不承担责任:"
	},
	{
		text: "(1)受到计算机病毒、木马或其他恶意程序，或其他可能具有污染性或破坏性的代码、黑客攻击的破坏；"
	},
	{
		lastText: "(2)用户或低碳中心的电脑软件、系统、硬件和通信线路出现故障。"
	},
	{
		title: "九、广告商"
	},
	{
		lastText:
			"虽然我们寻求与优质公司合作，但是我们对广告商和赞助商的主张或声明 (如有)不承担任何责任。低碳中心不对我们小程序上出现的任何广告商或赞助商的任何产品或服务进行审查，亦不对其承担任何责任。因广告商或赞助商滥用您提供的任何个人信息或资料造成的任何类型的损害，我们概不负责。"
	},
	{
		title: "十、禁止行为"
	},
	{
		text: "- 出于非法或欺诈目的使用小程序或服务 (包括链接) ;"
	},
	{
		text: "- 在小程序上发布包含病毒或其他恶意或污染性、破坏性代码的资料；"
	},
	{
		text: "- 从事任何具有诽谤性、侵犯他人个人隐私权或侵犯他人权利的活动;"
	},
	{
		text: "- 将小程序或服务用于非法、有害、威胁、侮辱、骚扰、侵权、诽谤、粗俗、淫秽、中伤、仇恨，贬低他人性别、种族、阶级、民族、国籍、宗教、性向、残疾等其他类型或其他负面的目的；"
	},
	{
		text: "- 对小程序或服务进行复制、修改、逆向工程、反汇编等，或创作其衍生产品，或以其他方式试图找出小程序或服务的任何源代码；"
	},
	{
		text: "- 删除或遮盖通过站点或服务获取的内容上的版权声明或其他声明；"
	},
	{
		text: "- 干扰或破坏小程序的功能、服务或连接小程序的服务器和网络，或者违背直接或间接连接小程序的网络的任何要求、程序、政策或规定，"
	},
	{
		text: "- 为了(包括但不限于)越权访问小程序或服务，以任何方式或形式修改小程序或服务，或使用修改后的小程序或服务，"
	},
	{
		text: "- 未经低碳中心事先书面许可，以本用户协议未授权的方式或商业用途复制、打印、缓存、存储、封装成顿或分发小程序或服务中检索的内容；"
	},
	{
		text: "- 出售、转让、再许可或以其他方式移转服务或小程序内容的任何权利；"
	},
	{
		text: "- 通过非低碳中心提供的界面访问站点或服务；"
	},
	{
		text: "- 使用小程序或服务违反任何法律 (无论地方、州/省/地区、国家法律还是国际法，无论是否有意)；"
	},
	{
		text: "- 冒充任何个人或实体，或虚假陈述或以其他方式歪曲您与任何个人或实体的关联关系；"
	},
	{
		text: "- 从事“屏幕抓取”，“数据库抓取”；"
	},
	{
		text: "- 协助违反本用户协议或隐私政策的行为。"
	},
	{
		text: "如果任何用户违反了本用户协议的任何条款，或者低碳中心有合理的理由认为用户违反了本用户协议的任何条款，包括任何用户从事了前述任何禁止活动，我们有权采取其认为适当的惩罚措施。此类惩罚措施包括但不限于:"
	},
	{
		text: "(1) 低碳中心可自行决定中止或终止用户的帐户及与该账户有关的全部帐户，且我们对因此造成的任何损失或损害，概不承担责任；"
	},
	{
		text: "(2)限制、降级、中止或终止订阅、访问或(当前或今后)使用任何服务;"
	},
	{
		text: "(3)对您使用任何服务的任何功能或特性施加低碳中心自行认为合理的其他限制；"
	},
	{
		lastText: "(4)低碳中心自行认为必要或适当的任何其他纠正措施、惩罚或处罚。"
	},
	{
		title: "十一、隐私保护"
	},
	{
		lastText:
			"小程序可能会收集某些用户的个人信息。请查看我们的隐私政策，了解我们如何处理您的个人信息、如何使用该信息、如何共享该信息以及您享有的与个人信息相关的权利。隐私政策系本用户协议的组成部分。"
	},
	{
		title: "十二、反馈"
	},
	{
		lastText:
			"我们欢迎用户就我们的服务给出的所有反馈、意见创意、素材和建议 (统称“反馈”)。您理解并同意，我们不放弃使用其此前或同时期已知的类似和/或相关反馈的任何权利，无论是由其员工、合同商开发，从其他来源获得还是由其他您提交的。此外，您提交反馈即授予我们无限制、无偿使用该反馈的权利。"
	},
	{
		title: "十三、所有权"
	},
	{
		text: "津志惠小程序及其内容受版权、商标和其他所有权法律的保护。"
	},
	{
		lastText:
			"小程序或服务中出现的所有津志惠徽标和/或商标都是我们的财产，未经我们明确书面同意不得使用。服务关联使用的所有其他商标、服务标志和徽标，无论是否署名，均为其各自所有者的商标、服务标志或徽标，未经其明确书面同意，不得使用。"
	},
	{
		title: "十四、责任限制"
	},
	{
		subTitle: "1、免责声明"
	},
	{
		text: "小程序和服务仅供参考之用。我们小程序上的内容均不构成专业建议，无论是医疗、财务、法律还是其他方面。您使用小程序、插件和服务须自行承担风险。该小程序、插件和服务均按“原样”提供并“可用”。我们不声明或保证其能满足您的需要，其安全、最新、准确无误且不会中断，或使用这些网站、插件和服务能获得准确、及时、有用或可靠的结果。在法律允许的最大范围内，我们拒绝以任何方式、出于任何目的就插件、网站、小程序和服务的使用或其内容的准确性、完整性、时效性或通用性提供任何明示或暗示的保证、声明或条件，包括但不限于适销性、具体适用性和非侵权性等方面的保证和条件。"
	},
	{
		subTitle: "2、间接损害免责"
	},
	{
		text: "在任何情况下，我们均不对因使用或无法使用插件、小程序或其任何服务或内容，或资料丢失而导致的任何附带的、特别的、结果性的、惩罚性的或间接损害承担责任，即使我们已被告知此类损害的可能性，且无论是由于合同、侵权行为、疏忽大意、产品责任、严格责任还是其他原因。"
	},
	{
		text: "所有用户自行决定从小程序或服务器下载或以其他方式获取任何资料并自担风险，并且对因下载此类资料给其自身或我们计算机系统造成任何损坏或任何资料丢失承担全部责任。用户从低碳中心小程序或通过使用小程序获得的任何口头或书面建议或资料均不构成本用户协议未明确说明的任何保证。"
	},
	{
		text: "就用户在本小程序上购买、以碳币兑换或抵扣或以其他方式获得的服务或产品，低碳中心不对此类服务或产品做任何保证或声明。低碳中心及其关联方也不承担此类服务或产品的任何责任。"
	},
	{
		text: "所有用户在此同意对低碳中心、我们的关联方、董事、高管和员工因用户访问或使用小程序或服务(包括但不限于在小程席上展示该用户的信息)，或因用户违反本适用条款的任何条件和条款引起的所有损失、索赔、赔偿责任(包括全额赔偿法律成本)进行赔偿使其免受损害。所有用户在此进一步同意对低碳中心，我们的关联方、董事、高管和员工因用户违背对我们所做声明和保证引起的所有损失、损害、索赔、赔偿责任(包括全额赔偿法律成本)进行赔偿，使其免受损害。"
	},
	{
		text: "尽管有任何前述规定，低碳中心、我们的员工、代理商、关联方、代表或以我们的名义行事的任何人对于每位用户在任何日历年度因访问或使用小程序或服务引起的全部索赔的累计赔偿责任不超过以下二者中的较小额:(a)用户在该年度向低碳中心购买和使用小程序或服务支付的费用金额，和(b)适用法律允许的最高金额。前述规定未免除用户证明其实际损害的责任。因使用小程序或服务引起的所有索赔须在诉讼事由产生之日起一年内或本条款适用法律规定的较长期限内提出。"
	},
	{
		lastText:
			"根据用户协议，您应承担的责任范围和免责限度为法律允许的最大范围，且无论我们是否收到通知或知悉造成此类损失的可能性，均应适用。"
	},
	{
		subTitle: "3、一般条款"
	},
	{
		text: "本用户协议及适用的服务条款构成用户与低碳中心签订关于用户访问和使用站点及其服务的完整协议，并取代此前有关主题事宜的所有协议。"
	},
	{
		text: "本用户协议应遵照中华人民共和国法律进行解释并受其管辖。"
	},
	{
		text: "凡因本用户协议引起或与之相关的纠纷、争议或索赔，包括涉及其产生、效力、解释或终止 (以下简称“争议”)的任何问题，各方应通过友好协商解决。如果自一方当事人就争议产生事宜书面通知另一方或多方当事人之日起三十 (30) 日之内未达成和解，任一方有权向津志惠小程序实际运营者所在地有管辖权的人民法院通过诉讼解决。"
	},
	{
		text: "用户或低碳中心未行使任何权利或执行本用户协议的任何条款不构成对该权利或条款的放弃。如果有管辖权的法院认为本用户协议的任何条款无效或不可执行.法院应在可能的范围内实行该条款反映的目的，且本用户协议的其他条款继续有效。"
	},
	{
		text: "如果本用户协议的任何条款无效或不可执行，则应删除该条款，而其他条款仍然有效并应得到执行。"
	},
	{
		text: "在任何情况下，因我们无法合理控制的不可抗力、武力或原因，包括但不限于互联网故障、计算机、电信或其他设备故障、电力故障、罢工、劳资纠纷、暴动、叛乱、内乱、劳动力或物资短缺、火灾、洪水暴风雨、爆炸、天灾、战争、政府行为、国内或国外法院或法庭的命令，或第三方违约行为，直接或间接导致通过本小程序访问或交付的内容或服务延迟、失败或中断，低碳中心均不承担责任。"
	},
	{
		lastText:
			"低碳中心有权基于业务调整等需要，将本用户协议 (包括将条款规定的我们的所有权利、所有权、收益、利益及义务和责任)转让给任何个人或实体(包括我们的任何关联方)，在前述转让情形发生时，我们将会通过小程序向您告知或者说明。未经低碳中心事先书面同意，您不得将本用户协议全部或部分转让给任何人或实体。"
	},
	{
		title: "十五、联系我们"
	},
	{
		text: (
			<>
				如您对我们的用户协议有任何问题或建议，请发送邮件至
				<Text className={"primary_color"}>3083241092@qq.com</Text>
				，与我们联系。我们将尽快审核您咨询的问题，并在验证您的身份后的十五天内或法律法规规定期限内予以回复。
			</>
		)
	}
];
