/*
 * @description:
 * @author yoke
 * @date 2023-05-09 13:58
 */

import "./index.scss";
import { Text } from "@tarojs/components";

export const List = [
	{
		title: "引言"
	},
	{
		text: (
			<>
				<Text className={"textDecoration fontWeightBold"}>津志惠小程序</Text>
				（以下简称“小程序”）由天津泰达低碳经济促进中心有限公司（以下简称“我们”或“低碳中心”）做技术支撑和运营。我们非常重视您的隐私，并承诺以安全和透明的方式保护您的个人信息。在您使用我们的产品和服务前及过程中，我们可能会处理
				(包括收集、存储、使用、加工、传输、提供、公开、删除等)您的相关个人信息。我们希望通过本《隐私政策》向您说明我们在处理您的个人信息时对应的处理规则以及您如何行使您的个人信息权利等相关事宜，以便更好的保障您的权益。我们会不时更新本《隐私政策》并在小程序上公布。当您访问我们使用我们的产品和服务前，请您务必仔细阅读并透彻理解本《隐私政策》，并做出您认为适当的选择，一旦您开始使用我们的产品和服务，即表示您已充分理解并同意本《隐私政策》的全部内容，否则您应当立即停止访问或使用小程序。需要提醒您注意，本隐私权保护政策仅适用于我们所收集的信息。
			</>
		)
	},
	{
		subTitle: "本《隐私政策》帮助您了解以下内容："
	},
	{
		text: "1、我们如何收集和使用您的个人信息"
	},
	{
		text: "2、我们如何使用Cookie"
	},
	{
		text: "3、我们如何存储、委托处理、共享、转让、公开披露您的个人信息"
	},
	{
		text: "4、我们如何保护您的个人信息"
	},
	{
		text: "5、您如何行使您的权利"
	},
	{
		text: "6、本《隐私政策》变更"
	},
	{
		text: "7、如何联系我们"
	},
	{
		subTitle: "相关术语及定义："
	},
	{
		text: (
			<>
				<Text className={"fontWeightBold"}>1、津志惠小程序：</Text>
				津志惠平台旨在积极倡导绿色低碳生活方式，着力打造人人参与的碳普惠体系，助力可持续发展。
			</>
		)
	},
	{
		text: (
			<>
				<Text className={"fontWeightBold"}>2、个人信息：</Text>
				指获得对个人信息的控制权行为，包括由个人信息主体主动提供、通过与个人信息主体交互或记录个人信息主体行为等自动采集，以及通过共享、转让、搜集公开信息间接获取等方式；
			</>
		)
	},
	{
		text: (
			<>
				<Text className={"fontWeightBold"}>3、收集：</Text>
				指获得对个人信息的控制权的行为，包括由个人信息主体主动提供、通过与个人信息主体交互或记录个人信息主体行为等自动采集，以及通过共享、转让、搜集公开信息间接获取等方式；
			</>
		)
	},
	{
		text: (
			<>
				<Text className={"fontWeightBold"}>4、删除：</Text>
				指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态；
			</>
		)
	},
	{
		text: (
			<>
				<Text className={"fontWeightBold"}>5、公开披露：</Text>
				指向社会或不特定人群发布信息的行为；
			</>
		)
	},
	{
		text: (
			<>
				<Text className={"fontWeightBold"}>6、转让：</Text>
				指将个人信息控制权由一个控制者向另一个控制者转移的过程；
			</>
		)
	},
	{
		lastText: (
			<>
				<Text className={"fontWeightBold"}>7、共享：</Text>
				指个人信息控制者向其他控制者提供个人信息，且双方分别对个人信息拥有独立控制权的过程。
			</>
		)
	},
	{
		title: "一、我们如何收集和使用您的个人信息"
	},
	{
		subTitle: "（一）您的个人信息以及收集方式"
	},
	{
		text: "1、您提供的信息"
	},
	{
		text: (
			<>
				您在使用小程序提供的服务时，为了更好地实现您的目的，我们会收集您主动提供的信息。这些信息取决于您的选择，可能包括您的微信昵称、姓名、性别、地址、手机号码、步行、骑行或其他行程信息、第三方消费记录、位置信息、日志信息、相册、相机等，以及你在使用中主动提供的其他信息等。为向您提供我们的服务，您需要向我们提供您的微信账号和微信绑定的手机号码，您的手机号码是您注册并使用小程序的方式，您需要通过微信账号/微信绑定的手机号码注册后才可以继续使用我们提供的相关服务。如您拒绝提供您的微信账号以及绑定手机号码等信息，您将无法使用我们提供的服务；除此之外，其他信息不是必须提供的，但是如缺失该信息，您将无法访问我们的某些内容或功能，或不能使用某些服务。
			</>
		)
	},
	{
		text: "2、您发布的信息"
	},
	{
		text: "您在小程序中公共区域主动发布的信息。"
	},
	{
		text: "3、为您提供服务过程中形成的信息"
	},
	{
		text: "我们以及为小程序提供产品和服务提供第三方、广告或其他提供商，可能会使用Cookie、像素标签、本地存储和其他技术自动在产品和服务过程中收集为您提供服务过程中形成的信息，包括但不限于账号名称、头像、手机号、收件地址、微信步数、位置信息 (包括通过GPS信息所获取的精确位置信息，和通过IP地址获取的粗略位置信息) 、服务使用信息 (包括使用行为记录、您主动发布或互动中产生的信息) 、个人设备权限信息(包括相册、相机信息)。"
	},
	{
		text: "4、支付信息"
	},
	{
		text: "在您购买资源或服务内容时，你可以通过小程序支持的第三方支付机构完成支付，支付功能本身不收集您的个人信息，但我们需要将您的订单号、交易金额以及其他您选择的支付机构要求的交易信息与您选择的支付机构共享信息，以实现其确认您的支付指令并完成支付。"
	},
	{
		subTitle: "（二）我们如何使用您的个人信息"
	},
	{
		text: "1、在向您提供我们的小程序或服务，并为改进小程序或服务时使用。"
	},
	{
		text: "2、在我们向您提供小程序和服务期间，您授权我们持续收集并基于向您提供服务的目的使用您的个人信息。在您注销服务后，我们将停止收集您的相关个人信息并在存储期限届满后及时删除已收集的您的个人信息或者进行匿名化处理。"
	},
	{
		text: "3、为提升您的小程序或服务体验，或为防范风险，我们会对服务使用情况进行汇总、统计分析、加工，但这些信息不会包含您的任何身份识别信息。"
	},
	{
		text: "4、为了提升您的小程序和服务的便利，使用更加丰富的服务，我们可能会将已收集的信息用于向您发送营销信息、用户体验改进或市场调查等用途。如果您同意我们将收集的信息用于前述用途，您可能会获得更好的用户体验，或收到您可能感兴趣的营销信息，或参与我们的市场调查活动。如果您不同意我们将您的信息用于前述用途，您可以联系我们的客服人员进行调整或退订。如果您选择调整或退订的，我们不会将收集的信息继续用于前述用途，您仍然可以根据协议使用我们提供的产品和服务。"
	},
	{
		lastText: "5、将您的个人信息用于法律允许的其它用途。"
	},
	{
		title: "二、我们如何存储、委托处理、共享、转让、公开披露您的个人信息"
	},
	{
		subTitle: "（一）存储"
	},
	{
		text: "1、我们将遵守相关的法律法规规定，将中华人民共和国境内收集的您的个人信息存储于中华人民共和国境内，并依法对这些信息进行严格保密。"
	},
	{
		text: "2、我们仅在法律法规要求的期限内，以及为实现本《隐私政策》的目的所必须的期限内，确保单个用户数据的最长存储期限以及用户日志的存储期限。"
	},
	{
		subTitle: "（二）委托处理"
	},
	{
		text: "为了提升信息处理的质量与效率，我们可能会在法律法规允许的范围内，委托有能力的合作机构代表我们来处理信息。我们郑重承诺，我们会遵守法律法规关于委托处理的相关规定，充分审查、评估此类合作机构保护个人信息的能力，通过书面协议、审计等方式要求合作机构严格遵守保密义务，采取技术方式对委托处理的信息进行脱敏处理，并禁止其将这些信息用于未经您授权的用途。在委托关系解除时，我们会要求合作机构不再保存相关信息。"
	},
	{
		subTitle: "（三）共享"
	},
	{
		text: "我们对您的个人信息严格保密，在以下情形下，我们可能将您的信息提供给第三方主体 (以下简称“第三方”)，第三方包括我们的关联公司、合作金融机构、国家机关以及我们的合作伙伴: (1) 协助我们提供津志惠产品和服务， (2) 以我们的名义提供津志惠产品和服务，(3) 我们的产品和服务中某些具体的模块或功能由外部供应商提供; (4) 帮助我们分析津志惠产品和服务。"
	},
	{
		text: "在将信息提供给第三方前，我们将会按照法律法规的规定进行评估，向您告知接收方的名称或者姓名、联系方式、处理目的、处理方式和个人信息的种类，并取得您的单独同意(根据法律法规无需取得同意的情形除外)。此外，我们还会与第三方签订相关法律文件并要求第三方在使用您的个人信息时遵守法律法规，在已告知您的处理目的、处理方式和个人信息的种类等范围内处理个人信息，并要求第三方采取管理措施和技术手段以保护您的个人信息。"
	},
	{
		subTitle: "（四）转让"
	},
	{
		text: "我们不会将您的个人信息转让给除关联公司外的任何公司、组织和个人，但以下情况除外:"
	},
	{
		text: "1、本《隐私政策》明确规定的情形；"
	},
	{
		text: "2、满足法律法规、法律程序的要求或强制性的政府要求或司法裁定；"
	},
	{
		text: "3、如果我们或我们的关联公司涉及合并、分立、清算、资产或业务的收购或出售等交易，您的个人信息有可能作为此类交易的一部分而被转移，我们将确保该等信息在转移时的机密性，在前述情形下，我们会向您告知有关情况，并要求新的持有您个人信息的公司、组织继续受本政策的约束。"
	},
	{
		subTitle: "（五）公开披露"
	},
	{
		text: "我们仅会在以下情况下，披露您的个人信息："
	},
	{
		text: "1、本《隐私政策》明确规定的情形；"
	},
	{
		text: "2、获得您的明确同意；"
	},
	{
		text: "3、基于法律的披露: 在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。"
	},
	{
		subTitle: "（六）无需征得您同意处理您的信息的情形"
	},
	{
		text: "根据相关法律法规及国家标准，在以下情形中，我们可能会依法收集并使用您的个人信息无需征得您的同意："
	},
	{
		text: "1、签订和履行您作为相对方的合同所必需；"
	},
	{
		text: "2、为履行法定职责或者法定义务所必需；"
	},
	{
		text: "3、与国家安全、国防安全，与犯罪侦查、起诉、审判和判决执行等直接相关；"
	},
	{
		text: "4、为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；"
	},
	{
		text: "5、为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；"
	},
	{
		text: "6、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；"
	},
	{
		text: "7、依照法律法规规定在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息;"
	},
	{
		text: "8、在合理的范围内处理您自行公开或者其他已经合法公开的个人信息的;"
	},
	{
		lastText: "9、法律、行政法规规定的其他情形。"
	},
	{
		title: "三、我们如何保护您的个人信息"
	},
	{
		text: "1、我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。"
	},
	{
		text: "2、我们重视您基于对我们的信任提供的个人信息，因此我们尽力使用商业方面可接受的方法来保护您的信息。然而请您理解，由于技术水平局限以及可能存在的恶意攻击，有可能出现我们无法合理预见、防范、避免、控制的意外情况。互联网并非绝对安全的环境，请使用复杂密码，协助我们保证您的账号安全。"
	},
	{
		text: "3、我们的服务可能包含跳转至其他网站、小程序的链接。如果单击第三方链接，您将直接访问该网站、小程序。请注意，这些外部网站或小程序并非我们运营。因此，我们强烈建议您浏览这些网站或小程序的隐私政策。我们无法控制任何第三方网站、小程序或服务的内容、隐私政策或操作，也不对此承担任何责任。"
	},
	{
		text: "4、如发生个人信息安全事件，我们将按照法律法规的要求，及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，或采取合理、有效的方式发布公告。同时，我们还将依据监管规定，上报个人信息安全事件处置情况。"
	},
	{
		text: "5、如何处理未成年人的个人信息。我们非常重视未成年人个人信息的保护。由于我们的网站和服务主要面向成人，如您为未成年人的，建议您请在您的父母或法定监护人陪同、指导下仔细阅读并同意本《隐私政策》，并在征得您的父母或法定监护人同意的前提下使用我们的服务或向我们提供信息。您及法定监护人应按照法律及本《隐私政策》规定承担责任，未成年人一旦使用我们的产品或服务，我们视为有法定监护人的同意或指导。"
	},
	{
		lastText:
			"对于经父母或法定监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或法定监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。如果我们发现已在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快对相关数据采取适当处理。"
	},
	{
		title: "四、你如何行使您的权利"
	},
	{
		text: (
			<Text className={"fontWeightBold"}>
				按照中国相关的法律、法规、标准，以及其他国家地区的通行做法，我们保障您对自己的个人信息行使以下权利:
			</Text>
		)
	},
	{
		subTitle: "(一) 查阅、复制、更正、补充您的个人信息"
	},
	{
		text: (
			<>
				您有权查阅、复制您的个人信息，法律法规规定的例外情况除外。如果您想行使前述的查阅、复制您的个人信息的权利，请通过
				<Text className={"primary_color"}>3083241092@qq.com</Text>
				联系我们。当您发现我们处理的关于您的个人信息有错误时，您有权要求我们作出更正或者补充，您可以通过
				<Text className={"primary_color"}>3083241092@qq.com</Text>联系我们提出更正申请。
			</>
		)
	},
	{
		subTitle: "(二) 改变个人信息授权"
	},
	{
		text: (
			<>
				您有权拒绝和退出某些使用和披露您个人信息的项目。如果您已经同意我们处理您的个人信息，您也可以发送电子邮件至
				<Text className={"primary_color"}>3083241092@qq.com</Text>
				，随时撤销该同意并退出进一步处理。
			</>
		)
	},
	{
		text: "请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们将无法继续为您提供撤回同意或授权所对应的服务，但不影响我们基于您未撤回的同意或授权为您提供的其他服务。此外，您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理."
	},
	{
		subTitle: "(三)删除您的个人信息"
	},
	{
		text: "除法律法规另有规定的情形外，在以下情形中，我们会主动或者基于您的请求删除您的个人信息"
	},
	{
		text: "1、我们对您的个人信息的处理目的已实现、无法实现或者为实现处理目的不再必要；"
	},
	{
		text: "2、我们停止提供服务，或者存储期限已届满；"
	},
	{
		text: "3、您撤回此前向我们做出的同意；"
	},
	{
		text: "4、我们违反法律、行政法规或与您的约定处理您的个人信息；"
	},
	{
		text: "5、法律、行政法规规定的其他应当删除个人信息的情形；"
	},
	{
		text: "6、涉及商业秘密的。"
	},
	{
		text: "法律、行政法规规定的存储期限未届满，或者删除个人信息从技术上难以实现的，我们将对您的个人信息停止除存储和采取必要的安全保护措施之外的处理。"
	},
	{
		subTitle: "(四)注销权"
	},
	{
		text: "您随时可注销您的津志惠账户。您可以联系我们的客服人员辅助您完成注销操作。一旦您注销账号，将无法使用我们的津志惠产品和服务，因此请您谨慎操作。我们为了保护您或他人的合法权益会结合您对我们公司各产品的使用情况判断是否支持您的注销请求，但不会设置不合理的障碍。除法律法规另有规定外，注销账号之后我们将停止为您提供产品和服务，并根据您的要求删除您的个人信息。"
	},
	{
		subTitle: "(五) 复制或转移您的个人信息。"
	},
	{
		text: "您可以联系我们的客服人员要求复制您的个人信息我们将及时提供。 您也可以联系我们的客服人员，要求我们将您的个人信息转移至您指定的第三方，在符合国家网信部门规定条件的情况下，我们将向您提供转移的途径。"
	},
	{
		subTitle: "(六) 例外情形"
	},
	{
		text: "尽管有上述约定，但在以下情形中，按照法律法规要求，我们将无法响应您的更正、删除、注销信息的请求:"
	},
	{
		text: "1、由于我们负有相关法律法规规定的义务；"
	},
	{
		text: "2、与国家安全、国防安全直接相关的；"
	},
	{
		text: "3、与公共安全、公共卫生、重大公共利益直接相关的；"
	},
	{
		text: "4、刑事侦查、起诉、审判和执行判决等直接相关的；"
	},
	{
		text: "5、有充分证据表明您滥用权利的；"
	},
	{
		text: "6、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；"
	},
	{
		text: "7、响应该等请求将导致您或其他个人、组织的合法权益受到严重损害的；"
	},
	{
		lastText: "8、涉及商业秘密的。"
	},
	{
		title: "五、本《隐私政策》的变更"
	},
	{
		lastText:
			"我们可能不时对本《隐私政策》进行修订并在津志惠小程序上发布更新的《隐私政策》。因此，建议您定期查看此页面的变更情况，并仔细阅读变更、修订后的《隐私政策》，如您不同意经变更后的政策，或对政策修改、更新的内容有异议，您可以选择停止使用或者注销账户。但请您知悉，您账户注销之前、停止使用本服务之前的行为和活动仍受本《隐私政策》的约束。"
	},
	{
		title: "六、联系我们"
	},
	{
		text: (
			<>
				如您对我们的《隐私政策》有任何问题或建议，请发送邮件至
				<Text className={"primary_color"}>3083241092@qq.com</Text>
				，与我们联系。我们将尽快审核您咨询的问题，并在验证您的身份后的十五天内或法律法规规定期限内予以回复。
			</>
		)
	}
];
